In [2]:
import pandas as pd
import seaborn as sns

In [3]:
pd.set_option('display.max_columns', None)

In [4]:
pd.set_option('display.width', 500)

In [5]:
df = sns.load_dataset("titanic")

In [6]:
df.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked  class    who  adult_male deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500        S  Third    man        True  NaN  Southampton    no  False
1         1       1  female  38.0      1      0  71.2833        C  First  woman       False    C    Cherbourg   yes  False
2         1       3  female  26.0      0      0   7.9250        S  Third  woman       False  NaN  Southampton   yes   True
3         1       1  female  35.0      1      0  53.1000        S  First  woman       False    C  Southampton   yes  False
4         0       3    male  35.0      0      0   8.0500        S  Third    man        True  NaN  Southampton    no   True

In [7]:
df["age2"] = df["age"] * 2

In [8]:
df["age3"] = df["age"] * 5

In [10]:
(df["age"] / 10).head()

0    2.2
1    3.8
2    2.6
3    3.5
4    3.5
Name: age, dtype: float64

In [11]:
df[["age", "age2", "age3"]].apply(lambda x : x ** 2).head()

      age    age2     age3
0   484.0  1936.0  12100.0
1  1444.0  5776.0  36100.0
2   676.0  2704.0  16900.0
3  1225.0  4900.0  30625.0
4  1225.0  4900.0  30625.0